{
    "what is a base detector": "It analyzes a string to detect if it's Base64, Base32, or other encodings.",
    "how do i use the decoder": "Select the encoding type (Base64, Base32, etc.) and paste the encoded text to decode it.",
    "what is base64": "It's a method to encode binary data into ASCII text using 64 characters.",
    "what does the decoder tool do": "It converts encoded text back to readable form using selected base encoding.",
    "how is the encryption done in cybernest": "It uses a custom algorithm where only the same tool can decrypt it, not any external tool.",
    "what is custom encryption": "It’s a site-specific method where key and input are hashed uniquely to prevent reverse-engineering.",
    "how do i decrypt a message": "Paste the encrypted text and enter the correct key to get the original message.",
    "what if i lose the key": "You cannot decrypt the message. The key is essential.",
    "what is metadata": "Metadata is hidden info like timestamp, camera model, GPS, etc., stored in files.",
    "what types of files work here": "Mainly image files (JPG, PNG), PDFs, and documents that store EXIF or meta info.",
    "how do i use this tool": "Upload the file and click 'Extract Metadata' to view hidden file properties.",
    "is this tool safe to use": "Yes, it runs locally and does not upload any data online.",
    "what is encryption": "Encryption is a method of converting information into a secret code to protect its confidentiality.",
    "encryption": "Encryption hides original messages by converting them into secret format using a key.",
    "what is cybernest": "CyberNest is a web-based cybersecurity toolkit that helps with CTF challenges, cryptography, and digital forensics.",
    "cybernest": "CyberNest is your one-stop toolkit for Capture the Flag, encryption/decryption, and forensic tools.",
    "tools in cybernest": "CyberNest includes: CTF Helper (Base Detector & Decoder), Cryptography Tool (Encrypt/Decrypt), and Digital Forensics (Metadata Extractor).",
    "how to use this": "Choose a tool from the homepage and follow the inputs for encoding, encryption, or file analysis.",
    "ctf helper": "CTF Helper contains two tools: Base Detector (for unknown encodings) and Decoder (to decode known formats).",
    "base detector": "Paste any suspicious text and it will detect whether it's base64, base32, hex, etc.",
    "decoder": "Select the encoding type and paste your text — it will decode it for you.",
    "cryptography tool": "This tool allows you to encrypt or decrypt text using a key that only works inside CyberNest.",
    "decryption": "Decryption reveals the original message if you have the correct key.",
    "digital forensics": "This tool extracts metadata like device info, timestamp, and GPS from uploaded files.",
    "metadata": "Upload an image or document and you'll see hidden metadata like camera model, GPS, date, and more.",
    "file analysis": "Upload a file in the forensics tool to extract metadata and perform investigations.",
    "help": "You can ask about any tool like 'encryption', 'metadata', 'ctf helper', or how to use this platform.",
    "contact": "This is a local tool demo — for help, refer to the project README or instructor."
}